{
    "abilities": [
        {
            "id": 1,
            "name": "Deploy Unit",
            "phase": "Deployment",
            "activation": "",
            "cost": "",
            "declare": "Pick a unit from your army roster that has not been deployed to be the target.",
            "effect": "Set up the target unit wholly within friendly territory and more than 9 inches from enemy territory. After you have done so, it has been deployed.",
            "keywords": "Deploy"
        },
        {
            "id": 2,
            "name": "Deploy Faction Terrain",
            "phase": "Deployment",
            "activation": "",
            "cost": "",
            "declare": "Pick a friendly faction terrain feature that has not been deployed to be the target.",
            "effect": "Set up the target faction terrain feature wholly within friendly territory, more than 3 inches from all objectives and other terrain features. After you have done so, it has been deployed.",
            "keywords": "Deploy Terrain"
        },
        {
            "id": 3,
            "name": "Deploy Regiment",
            "phase": "Deployment",
            "activation": "",
            "cost": "",
            "declare": "Pick a regiment from your army roster to be the target. No units in that regiment can have already been deployed.",
            "effect": "Keep using Deploy abilities without alternating until all units in that regiment have been deployed. You cannot pick units that are not in that regiment as the target of any of those Deploy abilities.",
            "keywords": "Deploy"
        },
        {
            "id": 4,
            "name": "Tactical Gambit",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "You cannot use this ability if you went second in the previous battle round and chose to go first in the current battle round.",
            "effect": " Pick 1 battle tactic that you have not yet attempted. You can attempt to complete that battle tactic this turn.",
            "keywords": ""
        },
        {
            "id": 5,
            "name": "Activate Place of Power",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "Pick a friendly Hero within 3 inches of any Places of Power to use this ability.",
            "effect": "Roll a dice. On a 1, inflict D3 mortal damage on that Hero. On a 2+: If that Hero is a Wizard or Priest, add 1 to casting rolls or chanting rolls for that Hero this turn. If that Hero is not a Wizard or Priest, they can use the ‘Unbind’ or ‘Banish Manifestation’ ability this turn as if they had Wizard (1)",
            "keywords": ""
        },
        {
            "id": 6,
            "name": "Do Not Waver",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "You complete this battle tactic at the end of your turn if 2 or more friendly units fought this turn and no friendly units were destroyed this turn.",
            "keywords": ""
        },
        {
            "id": 7,
            "name": "Slay the Entourage",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "Pick a unit in the enemy general’s regiment. You complete this battle tactic if that unit is destroyed this turn.",
            "keywords": ""
        },
        {
            "id": 8,
            "name": "Attack on Two Fronts",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "You complete this battle tactic at the end of your turn if you control 2 or more objectives that you did not control at the start of your turn and at least 1 of those objectives was controlled by your opponent at the start of your turn.",
            "keywords": ""
        },
        {
            "id": 9,
            "name": "Take Their Land",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "Pick a terrain feature wholly or partially within enemy territory and wholly outside friendly territory. You complete this battle tactic if you control that terrain feature at the end of your turn.",
            "keywords": ""
        },
        {
            "id": 10,
            "name": "Seize The Center",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "You complete this battle tactic at the end of your turn if2 or more friendly units are within 3 inches of the centre of the battlefield and are not in combat.",
            "keywords": ""
        },
        {
            "id": 11,
            "name": "Take The Flanks",
            "phase": "Start",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "You complete this battle tactic at the end of your turn if you have at least 1 friendly unit within 6 inches of each short battlefield edge, none of those units are wholly within friendly territory, and none of those units were set up this turn.",
            "keywords": ""
        },
        {
            "id": 12,
            "name": "Unbind",
            "phase": "Hero",
            "activation": "Reaction: Opponent declared a SPELL ability",
            "cost": "",
            "declare": "A friendly Wizard within 30 inches of the enemy Wizard casting the spell.",
            "effect": "Make an unbinding roll of 2D6. If the roll exceeds the casting roll for the spell, then the spell is unbound and its effect is not resolved. This reaction cannot be used more than once per casting roll.",
            "keywords": "Unbind"
        },
        {
            "id": 13,
            "name": "Banish Manifestation",
            "phase": "Hero",
            "activation": "Your Hero Phase",
            "cost": "",
            "declare": "Pick a friendly Wizard or Priest to use this ability, pick a manifestation within 30 inches of them to be the target, then make a banishment roll of 2D6.",
            "effect": "If the banishment roll equals or exceeds the banishment value listed on the manifestation’s warscroll, it is banished and removed from play. You cannot pick the same manifestation as the target of this ability more than once per turn.",
            "keywords": "Banish"
        },
        {
            "id": 14,
            "name": "Rally",
            "phase": "Hero",
            "activation": "Any Hero Phase",
            "cost": "1 Command Point",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "Make 6 rally rolls of D6. For each 4+, you receive 1 rally point. Rally points can be spent in the following ways: For each rally point spent, Heal (1) that unit. You can spend a number of rally points equal to the Health characteristic of that unit to return a slain model to that unit. You can spend the rally points in any combination of the above. Unspent rally points are then lost.",
            "keywords": ""
        },
        {
            "id": 15,
            "name": "Magical Intervention",
            "phase": "Hero",
            "activation": "Enemy Hero Phase",
            "cost": "1 Command Point",
            "declare": "Pick a friendly Wizard or Priest to use this ability.",
            "effect": "That friendly unit can use a Spell or Prayer ability (as appropriate) as if it were your hero phase. If you do so, subtract 1 from casting rolls or chanting rolls made as part of that ability.",
            "keywords": ""
        },
        {
            "id": 16,
            "name": "All-Out Defence",
            "phase": "Hero",
            "activation": "Reaction: Opponent declared an Attack ability",
            "cost": "1 Command Point",
            "declare": "A unit targeted by that Attack ability.",
            "effect": "Add 1 to save rolls for that unit in this phase.",
            "keywords": ""
        },
        {
            "id": 17,
            "name": "Normal Move",
            "phase": "Movement",
            "activation": "Your Movement Phase",
            "cost": "",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "That unit can move a distance up to its Move characteristic. That unit cannot move into combat during any part of that move.",
            "keywords": "Core, Move"
        },
        {
            "id": 18,
            "name": "Run",
            "phase": "Movement",
            "activation": "Your Movement Phase",
            "cost": "",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "Make a run roll of D6. That unit can move a distance up to its Move characteristic added to the run roll. That unit cannot move into combat during any part of that move.",
            "keywords": "Core, Move, Run"
        },
        {
            "id": 19,
            "name": "Retreat",
            "phase": "Movement",
            "activation": "Your Movement Phase",
            "cost": "",
            "declare": "Pick a friendly unit that is in combat to use this ability.",
            "effect": "Inflict D3 mortal damage on that unit. That unit can move a distance up to its Move characteristic. That unit can move through the combat ranges of any enemy units but cannot end that move within an enemy unit’s combat range.",
            "keywords": ""
        },
        {
            "id": 20,
            "name": "At The Double",
            "phase": "Movement",
            "activation": "Reaction: You declared a Run Ability",
            "cost": "1 Command Point",
            "declare": "The unit using that Run ability.",
            "effect": "Do not make a run roll as part of that Run ability. Instead, add 6 inches to that unit’s Move characteristic to determine the distance each model in that unit can move as part of that Run ability",
            "keywords": ""
        },
        {
            "id": 21,
            "name": "Redeploy",
            "phase": "Movement",
            "activation": "Enemy Movement Phase",
            "cost": "1 Command Point",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "Each model in that unit can move up to D6 inches. That move cannot pass through or end within the combat range of an enemy unit.",
            "keywords": "Move, Run"
        },
        {
            "id": 22,
            "name": "Shoot",
            "phase": "Shooting",
            "activation": "Your Shooting Phase",
            "cost": "",
            "declare": "Pick a friendly unit that has not used a Run or Retreat ability this turn to use this ability. Then, pick one or more enemy units as the target(s) of that unit’s attacks (see 16.0).",
            "effect": "Resolve shooting attacks against the target unit(s).",
            "keywords": "Core, Attack, Shoot"
        },
        {
            "id": 23,
            "name": "Covering Fire",
            "phase": "Shooting",
            "activation": "Enemy Shooting Phase",
            "cost": "1 Command Point",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "Resolve shooting attacks for that unit, but all of the attacks must target the nearest visible enemy unit and you must subtract 1 from the hit rolls for those attacks.",
            "keywords": "Attack, Shoot"
        },
        {
            "id": 24,
            "name": "All-Out Defence",
            "phase": "Shooting",
            "activation": "Reaction: Opponent declared an Attack ability",
            "cost": "1 Command Point",
            "declare": "A unit targeted by that Attack ability.",
            "effect": "Add 1 to save rolls for that unit in this phase.",
            "keywords": ""
        },
        {
            "id": 25,
            "name": "Charge",
            "phase": "Charge",
            "activation": "Your Charge Phase",
            "cost": "",
            "declare": "Pick a friendly unit that is not in combat and has not used a Run or Retreat ability this turn to use this ability. Then, make a charge roll of 2D6.",
            "effect": "That unit can move a distance up to the value of the charge roll. That unit can move through the combat ranges of any enemy units and must end that move within ½ inches of a visible enemy unit. If it does so, the unit using this ability has charged.",
            "keywords": "Core, Move, Charge"
        },
        {
            "id": 26,
            "name": "Forward To Victory",
            "phase": "Charge",
            "activation": "Reaction: You declared a Charge Ability",
            "cost": "1 Command Point",
            "declare": "The unit using that Charge ability.",
            "effect": "You can re-roll the charge roll.",
            "keywords": ""
        },
        {
            "id": 27,
            "name": "Counter-Charge",
            "phase": "Charge",
            "activation": "Enemy Charge Phase",
            "cost": "2 Command Point",
            "declare": "Pick a friendly unit that is not in combat to use this ability.",
            "effect": "That unit can use a Charge ability as if it were your charge phase.",
            "keywords": ""
        },
        {
            "id": 28,
            "name": "Fight",
            "phase": "Combat",
            "activation": "Any Combat Phase",
            "cost": "",
            "declare": "Pick a friendly unit that is in combat or that charged this turn to use this ability. That unit can make a pile-in move (see 15.4). Then, if that unit is in combat, you must pick one or more enemy units as the target(s) of that unit’s attacks (see 16.0).",
            "effect": "Resolve combat attacks against the target unit(s).",
            "keywords": "Core, Attack, Fight"
        },
        {
            "id": 29,
            "name": "All-Out Attack",
            "phase": "Combat",
            "activation": "Reaction: You declared an Attack ability",
            "cost": "1 Command Point",
            "declare": "The unit using that Attack ability.",
            "effect": "Add 1 to hit rolls for attacks made as part of that Attack ability. This also affects weapons that have the Companion weapon ability.",
            "keywords": ""
        },
        {
            "id": 30,
            "name": "All-Out Defence",
            "phase": "Combat",
            "activation": "Reaction: Opponent declared an Attack ability",
            "cost": "1 Command Point",
            "declare": "A unit targeted by that Attack ability.",
            "effect": "Add 1 to save rolls for that unit in this phase.",
            "keywords": ""
        },
        {
            "id": 31,
            "name": "Power Through",
            "phase": "End",
            "activation": "End of Any Turn",
            "cost": "1 Command Point",
            "declare": "Pick a friendly unit that charged this turn to use this ability, then you must pick an enemy unit in combat with it to be the target. The target must have a lower Health characteristic than the unit using this ability. ",
            "effect": "Inflict D3 mortal damage on the target. Then, the unit using this ability can move a distance up to its Move characteristic. It can pass through and end that move within the combat ranges of enemy units that were in combat with it at the start of the move, but not those of other enemy units. It does not have to end the move in combat.",
            "keywords": "Move"
        },
        {
            "id": 32,
            "name": "Musician",
            "phase": "Passive",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "While this unit contains any musicians, if it uses the ‘Rally’ command, you can make one additional rally roll of D6.",
            "keywords": ""
        },
        {
            "id": 33,
            "name": "Ward Save",
            "phase": "Passive",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": " In step 1 of the damage sequence (see 18.0), make a ward roll of D6 for each damage point in this unit’s damage pool. If the roll equals or exceeds this unit’s ward value, remove that damage point from the damage pool.",
            "keywords": ""
        },
        {
            "id": 34,
            "name": "Guarded Hero",
            "phase": "Passive",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "If this Hero is within the combat range of a friendly unit that is not a Hero: Subtract 1 from hit rolls for shooting attacks that target this Hero. If this Hero is Infantry, they cannot be picked as the target of shooting attacks made by units more than 12 inches from them.",
            "keywords": ""
        },
        {
            "id": 35,
            "name": "Champion",
            "phase": "Passive",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "Add 1 to the Attacks characteristic of weapons used by champions in this unit.",
            "keywords": ""
        },
        {
            "id": 36,
            "name": "Standard Bearer",
            "phase": "Passive",
            "activation": "",
            "cost": "",
            "declare": "",
            "effect": "While this unit contains any standard bearers, add 1 to this unit’s control score.",
            "keywords": ""
        }
    ],
    "roster": [
        {
            "id": 1,
            "name": "Test Dummy",
            "move": 4,
            "health": 2,
            "control": 1,
            "save": 3,
            "weapons": [
                {
                    "id": 1,
                    "attacks": 2,
                    "hit": 4,
                    "wound": 3,
                    "rend": 1,
                    "damage": 1,
                    "ability": "Some ability"
                }
            ],
            "keywords": "Infantry, Champion, Standard Bearer(1/10), Destruction, Ironjawz"
        }
    ]
}